Repository: amassias/WarmupCalculator
Catalog: WarmupCalculator/*.lproj/Localizable.strings
Languages: fr

# Calcul
source: Calculator
fr: Calcul

# Profil
source: Profile
fr: Profil

source: Optimize your warm-up sets based on the exercise, protocol, and your level.
fr: Optimisez vos séries d'échauffement selon l'exercice, le protocole et votre niveau.

# Exercice & charge
source: Exercise & load
fr: Exercice & charge

# Choisir un exercice
source: Choose an exercise
fr: Choisir un exercice

# Poids de travail
source: Working weight
fr: Poids de travail

# Poids
source: Weight
fr: Poids

# Unité
source: Unit
fr: Unité

# Estimer mon 1RM
source: Estimate my 1RM
fr: Estimer mon 1RM

# Modèle d'échauffement
source: Warm-up model
fr: Modèle d'échauffement

# Modèle
source: Model
fr: Modèle

# Calculer l'échauffement
source: Calculate warm-up
fr: Calculer l'échauffement

# Protocoles générés
source: Generated protocols
fr: Protocoles générés

source: Select your exercise and working weight, then run the calculation to see the recommended sets.
fr: Renseignez votre exercice et votre charge puis lancez le calcul pour voir les séries recommandées.

# Recommandations
source: Recommendations
fr: Recommandations

source: • Rest 45-60 sec between warm-up sets. • Rest 2-3 min before the working set. • Focus on technique and breathing.
fr: • Repos 45-60 sec entre les séries d'échauffement. • Repos 2-3 min avant la série de travail. • Concentrez-vous sur la technique et la respiration.

# Nom de l'exercice
source: Exercise name
fr: Nom de l'exercice

# Nom
source: Name
fr: Nom

# Catégorie
source: Category
fr: Catégorie

# Matériel
source: Equipment
fr: Matériel

# Les exercices ajoutés sont sauvegardés localement sur l'appareil.
source: Added exercises are saved locally on the device.
fr: Les exercices ajoutés sont sauvegardés localement sur l'appareil.

# Nouvel exercice
source: New exercise
fr: Nouvel exercice

# Fermer
source: Close
fr: Fermer

# Ajouter
source: Add
fr: Ajouter

# Ajouter un exercice
source: Add an exercise
fr: Ajouter un exercice

# Impossible de trouver votre mouvement ? Ajoutez-le et indiquez sa catégorie.
source: Can't find your movement? Add it and choose its category.
fr: Impossible de trouver votre mouvement ? Ajoutez-le et indiquez sa catégorie.

# Polyarticulaire vs Isolation
source: Compound vs Isolation
fr: Polyarticulaire vs Isolation

# Erreur
source: Error
fr: Erreur

# Comprendre les catégories
source: Understand the categories
fr: Comprendre les catégories

# Conseils pratiques
source: Practical tips
fr: Conseils pratiques

source: • Compound movements need more warm-up sets. • Isolation exercises only need 1 to 2 light sets before working sets. • If in doubt, think about the number of joints involved and your usual load.
fr: • Les mouvements polyarticulaires demandent davantage de séries d'échauffement. • Les exercices d'isolation se contentent d'1 à 2 séries légères avant d'attaquer le travail. • Si vous hésitez, pensez au nombre d'articulations impliquées et à la charge habituelle.

# Types d'exercices
source: Exercise types
fr: Types d'exercices

# Sélectionnez le repos
source: Select rest
fr: Sélectionnez le repos

# Performance récente
source: Recent performance
fr: Performance récente

# Poids soulevé
source: Weight lifted
fr: Poids soulevé

# Formule de Brzycki – résultat indicatif, votre 1RM réel peut varier.
source: Brzycki formula – indicative result, your actual 1RM may vary.
fr: Formule de Brzycki – résultat indicatif, votre 1RM réel peut varier.

# Entrez un poids et des répétitions valides pour obtenir une estimation.
source: Enter a valid weight and reps to get an estimate.
fr: Entrez un poids et des répétitions valides pour obtenir une estimation.

# Utiliser comme charge de travail
source: Use as working weight
fr: Utiliser comme charge de travail

# Niveau d'entraînement
source: Training level
fr: Niveau d'entraînement

# Niveau
source: Level
fr: Niveau

# Unités de poids
source: Weight units
fr: Unités de poids

# Le choix est mémorisé et utilisé pour tous les calculs.
source: The choice is saved and used for all calculations.
fr: Le choix est mémorisé et utilisé pour tous les calculs.

# Langue de l'application
source: App language
fr: Langue de l'application

# Le changement de langue s'applique immédiatement.
source: Language changes apply immediately.
fr: Le changement de langue s'applique immédiatement.

# Langue
source: Language
fr: Langue

# Ressources
source: Resources
fr: Ressources

# Comprendre les protocoles
source: Understand the protocols
fr: Comprendre les protocoles

# Différence polyarticulaire / isolation
source: Compound vs isolation difference
fr: Différence polyarticulaire / isolation

# Profil & réglages
source: Profile & settings
fr: Profil & réglages

# Modèle Progressif
source: Progressive model
fr: Modèle Progressif

source: Ideal for maximal loads and strength. Gradually increase the percentage of the working weight to prepare the nervous system and refine technique.
fr: Idéal pour les charges maximales et la force. On augmente progressivement le pourcentage du poids de travail pour préparer le système nerveux et affiner la technique.

# Protocole recommandé
source: Recommended protocol
fr: Protocole recommandé

# 50-60% × 8 répétitions
source: 50-60% × 8 reps
fr: 50-60% × 8 répétitions

# 70% × 5 répétitions
source: 70% × 5 reps
fr: 70% × 5 répétitions

# 80% × 3 répétitions
source: 80% × 3 reps
fr: 80% × 3 répétitions

# 90-95% × 1 répétition
source: 90-95% × 1 rep
fr: 90-95% × 1 répétition

source: Advanced lifters can add an extra intermediate ramp or a light single at 92%.
fr: Les athlètes avancés peuvent ajouter une montée intermédiaire supplémentaire ou un single léger à 92%.

# Quand l'utiliser ?
source: When to use it?
fr: Quand l'utiliser ?

source: • Heavy strength sessions (squat, bench press, deadlift). • Goal: maximize performance on a main load. • Perfect for intermediate and advanced lifters wanting no surprises on the working set.
fr: • Séances de force lourde (squat, développé couché, soulevé de terre). • Objectif : maximiser la performance sur une charge principale. • Parfait pour les pratiquants intermédiaires et avancés qui veulent limiter les surprises sur la série de travail.

# Modèle Potentiation 80%
source: Potentiation 80% model
fr: Modèle Potentiation 80%

source: Short, intense warm-up to quickly reach working sets. Uses a direct ramp to 80-85% to activate without too much fatigue.
fr: Échauffement court et intense pour passer rapidement aux séries effectives. Utilise une montée directe vers 80-85% pour activer sans générer trop de fatigue.

# ≈50% × 6-8 répétitions
source: ≈50% × 6-8 reps
fr: ≈50% × 6-8 répétitions

# ≈80% × 3-5 répétitions
source: ≈80% × 3-5 reps
fr: ≈80% × 3-5 répétitions

source: Advanced lifters can add a single at 90-92% to maximize potentiation.
fr: Les pratiquants avancés peuvent ajouter un single à 90-92% pour maximiser la potentiation.

source: • Speed or explosive sessions. • Experienced athletes with limited time. • Best for compound movements. For isolation work, stick to 1-2 light sets.
fr: • Séances explosives ou de vitesse. • Athlètes confirmés disposant de peu de temps. • À privilégier sur les mouvements polyarticulaires. Pour les isolations, limitez-vous à 1-2 séries légères.

# Modèles d'échauffement
source: Warm-up models
fr: Modèles d'échauffement

# Barre à vide
source: Empty bar
fr: Barre à vide

# Activation supplémentaire
source: Additional activation
fr: Activation supplémentaire

# Single technique
source: Technical single
fr: Single technique

# Potentiation neuromusculaire
source: Neural potentiation
fr: Potentiation neuromusculaire

# Single léger
source: Light single
fr: Single léger

# Single de potentiation
source: Potentiation single
fr: Single de potentiation

# Polyarticulaire
source: Compound
fr: Polyarticulaire

source: Engages multiple joints and muscle groups (e.g., squat, bench press).
fr: Mobilise plusieurs articulations et groupes musculaires (ex: squat, développé couché).

# Mouvements d'assistance polyarticulaires ou variantes plus légères.
source: Assistance compound movements or lighter variations.
fr: Mouvements d'assistance polyarticulaires ou variantes plus légères.

source: Targets a specific muscle or joint (e.g., biceps curl, triceps extension).
fr: Cible un muscle ou une articulation spécifique (ex: curl biceps, extension triceps).

source: Machine-guided exercises. Classify them as compound- or isolation-focused.
fr: Exercices guidés sur machine. Classer selon la dominante polyarticulaire ou isolation.

# Barre
source: Barbell
fr: Barre

# Haltère
source: Dumbbell
fr: Haltère

# Progressif
source: Progressive
fr: Progressif

# Montée graduelle en charge avec single lourd pour activer le système nerveux.
source: Gradual ramp with a heavy single to activate the nervous system.
fr: Montée graduelle en charge avec single lourd pour activer le système nerveux.

# Deux séries rapides pour un échauffement court mais puissant.
source: Two quick sets for a short but powerful warm-up.
fr: Deux séries rapides pour un échauffement court mais puissant.

# Débutant
source: Beginner
fr: Débutant

# Intermédiaire
source: Intermediate
fr: Intermédiaire

# Avancé
source: Advanced
fr: Avancé

source: Less than a year of regular training. Focus on technique and moderate loads.
fr: Moins d'un an de pratique régulière. Travail technique prioritaire et charges modérées.

# 1 à 3 ans d'entraînement sérieux. Technique stable, charges modérées à lourdes.
source: 1 to 3 years of serious training. Stable technique, moderate to heavy loads.
fr: 1 à 3 ans d'entraînement sérieux. Technique stable, charges modérées à lourdes.

source: More than 3 years of practice. Heavy loads mastered and personalized programming.
fr: Plus de 3 ans de pratique. Charges lourdes maîtrisées et programmation personnalisée.

# Français
source: French
fr: Français

# Cet exercice existe déjà dans la bibliothèque.
source: This exercise already exists in the library.
fr: Cet exercice existe déjà dans la bibliothèque.

# %d répétitions • %d%%
source: %d reps • %d%%
fr: %d répétitions • %d%%

# Répétitions: %d
source: Repetitions: %d
fr: Répétitions: %d

# 1RM estimé : %.1f %@
source: Estimated 1RM: %.1f %@
fr: 1RM estimé : %.1f %@

# Langue actuelle : %@
source: Current language: %@
fr: Langue actuelle : %@

# Niveau : %@
source: Level: %@
fr: Niveau : %@

source: RUNNING
fr: EN COURS

source: READY
fr: PRÊT

source: Reset
fr: Réinitialiser

source: Start
fr: Démarrer
